{
  "HomePage": {
    "intro": {
      "heading": "पाठ्यक्रम परिचय",
      "description": "React ट्यूटोरियल में आपका स्वागत है! यह व्यापक कोर्स नए लोगों के लिए तैयार किया गया है और आपको React के मूल तत्वों के माध्यम से ले जाएगा, जो उपयोगकर्ता इंटरफेस बनाने के लिए एक व्यापक रूप से उपयोग की जाने वाली जावास्क्रिप्ट पुस्तकालय है। आप कंपोनेंट्स, प्रॉप्स, स्टेट प्रबंधन, हुक्स, कॉन्टेक्स्ट API, और राउटिंग के बारे में जानेंगे। प्रत्येक पाठ में व्यावहारिक उदाहरण, हाथों-हाथ प्रोजेक्ट, और स्पष्ट व्याख्याएँ शामिल हैं ताकि आप React विकास के मूल सिद्धांतों को समझ सकें। इस कोर्स के अंत तक, आपके पास अपने स्वयं के गतिशील वेब अनुप्रयोग बनाने के लिए कौशल और आत्मविश्वास होगा। चाहे आप शुरू से शुरुआत कर रहे हों या अपने ज्ञान को ताज़ा करने की कोशिश कर रहे हों, यह ट्यूटोरियल आपके React यात्रा के लिए एकदम सही शुरुआती बिंदु है!"
    },
    "Prerequisites": {
      "heading": "पूर्व आवश्यकताएँ",
      "description": "इस पाठ्यक्रम को शुरू करने से पहले, यह अनुशंसा की जाती है कि आपको HTML, CSS, और जावास्क्रिप्ट की बुनियादी समझ हो। ES6 सिंटैक्स जैसी आधुनिक जावास्क्रिप्ट सुविधाओं की परिचितता सहायक होगी।"
    },
    "React_Overview": {
      "heading": "React का अवलोकन",
      "description": "React उपयोगकर्ता इंटरफेस बनाने के लिए एक शक्तिशाली पुस्तकालय है। यह डेवलपर्स को बड़े वेब अनुप्रयोग बनाने की अनुमति देता है जो डेटा को बिना पृष्ठ को फिर से लोड किए बदल सकते हैं। इसका कंपोनेंट-आधारित आर्किटेक्चर पुन: उपयोगिता और कुशल UI विकास को बढ़ावा देता है।"
    },
    "Development_Environment": {
      "heading": "अपने विकास वातावरण की सेटिंग",
      "description": "React के साथ शुरू करने के लिए, आपको अपने विकास वातावरण को सेटअप करने की आवश्यकता होगी। इसमें Node.js, npm, और create-react-app स्थापित करना शामिल है, जो आपको जल्दी से एक नया React अनुप्रयोग शुरू करने में मदद करेगा।"
    },
    "React_App": {
      "heading": "आपका पहला React ऐप बनाना",
      "description": "इस खंड में, हम आपको create-react-app का उपयोग करके आपका पहला React अनुप्रयोग बनाने के चरणों के माध्यम से मार्गदर्शित करेंगे। आप अपने प्रोजेक्ट को संरचना करने और उपकरण द्वारा उत्पन्न फ़ाइलों को समझने के तरीके सीखेंगे।"
    },
    "Project_Structure": {
      "heading": "प्रोजेक्ट संरचना को समझना",
      "description": "एक सुव्यवस्थित प्रोजेक्ट संरचना आपके React अनुप्रयोगों को स्केल करने के लिए बहुत महत्वपूर्ण है। हम सामान्य फ़ोल्डर संरचना, प्रत्येक फ़ोल्डर की भूमिका, और अपने कंपोनेंट्स को व्यवस्थित करने के लिए सर्वोत्तम प्रथाओं का अन्वेषण करेंगे।"
    },
    "React_Component": {
      "heading": "React कंपोनेंट्स के साथ काम करना",
      "description": "कंपोनेंट्स किसी भी React अनुप्रयोग के निर्माण खंड होते हैं। आप कार्यात्मक और वर्ग कंपोनेंट्स बनाने, उनके स्टेट और प्रॉप्स को प्रबंधित करने, और कंपोनेंट लाइफसाइकिल विधियों को समझने के बारे में सीखेंगे।"
    },
    "React_Works": {
      "heading": "React कैसे काम करता है",
      "description": "यह समझना कि React कैसे काम करता है, आपको अनुप्रयोगों का निर्माण करते समय बेहतर निर्णय लेने में मदद करेगा। हम वर्चुअल DOM, सामंजस्यकरण, और कैसे React कुशलता से UI को अपडेट करता है जैसे अवधारणाओं में गहराई से जाएंगे।"
    }
  }
}
